Tekla Open API Reference for Tekla Structures 2025
WorkPlaneHandler Methods
The WorkPlaneHandler type exposes the following members.
Methods
Name | Description
GetCurrentTransformationPlane
 Gets the current transformation plane.
SetCurrentTransformationPlane
 Sets the current transformation plane.
Top
See Also
Reference
WorkPlaneHandler Class
Tekla.Structures.Model Namespace